import numpy as np

''' 7 tile（数组，重复次数） 重复次数=整数或元组 '''
arr10 = np.array([[1, 2, 3],
                  [4, 5, 6],
                  [7, 8, 9]])  # 3 * 3

print('#' * 50)
print(np.tile(arr10, 4))
# [[1 2 3 1 2 3 1 2 3 1 2 3]
#  [4 5 6 4 5 6 4 5 6 4 5 6]
#  [7 8 9 7 8 9 7 8 9 7 8 9]]

print('#' * 50)
print(np.tile(arr10, reps=(2, 2, 3)).shape)  # (2, 6, 9)
print('#' * 50)
print(np.tile(arr10, reps=(2, 2, 3)))
"""
reps=(2, 2, 3): 表示在每个维度上重复的次数：
    第三个轴（最后一个轴）重复 3 次，
    第二个轴重复 2 次，
    第一个轴重复 2 次。
元组对应 shape 相乘 (2, 2, 3) * (3, 3) = (2, 6, 9)
"""
# [[[1 2 3 1 2 3 1 2 3]
#   [4 5 6 4 5 6 4 5 6]
#   [7 8 9 7 8 9 7 8 9]
#   [1 2 3 1 2 3 1 2 3]
#   [4 5 6 4 5 6 4 5 6]
#   [7 8 9 7 8 9 7 8 9]]
#
#  [[1 2 3 1 2 3 1 2 3]
#   [4 5 6 4 5 6 4 5 6]
#   [7 8 9 7 8 9 7 8 9]
#   [1 2 3 1 2 3 1 2 3]
#   [4 5 6 4 5 6 4 5 6]
#   [7 8 9 7 8 9 7 8 9]]]

''' 8. repeat(数组, 重复次数, axis=轴)  指定轴重复 '''
arr11 = np.array([[1, 2, 3],
                  [4, 5, 6],
                  [7, 8, 9]])
print('#' * 50, "repeat")
print(np.repeat(arr11, 2, axis=0))
# [[1 2 3]
#  [1 2 3]
#  [4 5 6]
#  [4 5 6]
#  [7 8 9]
#  [7 8 9]]

print('#' * 50)
print(np.repeat(arr11, 3, axis=1))
# [[1 1 1 2 2 2 3 3 3]
#  [4 4 4 5 5 5 6 6 6]
#  [7 7 7 8 8 8 9 9 9]]

print('#' * 50)
# repaets=(轴的个数)
print(np.repeat(arr11, (3, 1, 2), axis=0))
"""
repeats: 每个元素/行重复的次数（这里是一个元组 (3, 1, 2)）
axis=0: 表示按行方向进行重复

arr11 是一个 3x3 的二维数组
repeats=(3, 1, 2) 表示：
    第 0 行重复 3 次
    第 1 行重复 1 次（即保持不变）
    第 2 行重复 2 次
"""
# [[1 2 3]
#  [1 2 3]
#  [1 2 3]
#  [4 5 6]
#  [7 8 9]
#  [7 8 9]]

# 间隔矩阵
m = np.zeros((8, 8))
m[1::2, ::2] = 1
m[0::2, 1::2] = 1
print('#' * 50)
print(m)
# [[0. 1. 0. 1. 0. 1. 0. 1.]
#  [1. 0. 1. 0. 1. 0. 1. 0.]
#  [0. 1. 0. 1. 0. 1. 0. 1.]
#  [1. 0. 1. 0. 1. 0. 1. 0.]
#  [0. 1. 0. 1. 0. 1. 0. 1.]
#  [1. 0. 1. 0. 1. 0. 1. 0.]
#  [0. 1. 0. 1. 0. 1. 0. 1.]
#  [1. 0. 1. 0. 1. 0. 1. 0.]]