import numpy as np

arr4 = np.arange(24).reshape(2, 3, 4)
print('*' * 50)
print(arr4)
# [[[ 0  1  2  3]
#   [ 4  5  6  7]
#   [ 8  9 10 11]]
#
#  [[12 13 14 15]
#   [16 17 18 19]
#   [20 21 22 23]]]

print('*' * 50)
print(arr4[1, [[0, 1, 2], [2, 1, 0]], 1])
"""
实际提取的是：
    arr4[1, 0, 1] -> 13
    arr4[1, 1, 1] -> 17
    arr4[1, 2, 1] -> 21
    
    arr4[1, 2, 1] -> 21
    arr4[1, 1, 1] -> 17
    arr4[1, 0, 1] -> 13
"""
# [[13 17 21]
#  [21 17 13]]

print('*' * 50)
print(arr4[:, [[0, 1, 2], [2, 1, 0]], 1])
"""
同上，只是多了个 0 维
"""
# [[[ 1  5  9]
#   [ 9  5  1]]
#
#  [[13 17 21]
#   [21 17 13]]]

# print('*' * 50)
# print(arr4[1, [[0, 1, 2], [2, 1, 0]], [0, 1]])
# 出错
# IndexError: shape mismatch: indexing arrays could not be broadcast together with shapes (2,3) (2,)

print('*' * 50)
print(arr4[1, [[0, 1, 2], [2, 1, 0]], [0, 1, 2]])
"""
[[0, 1, 2], [2, 1, 0]] 和 [0, 1, 2] 配合使用，相当于以下两批坐标：
第一批：[[0, 1, 2], [0, 1, 2]]
    第一组：行=0, 列=0 → 12
    第二组：行=1, 列=1 → 17
    第三组：行=2, 列=2 → 22
第二批：[[2, 1, 0], [0, 1, 2]]
    第一组：行=2, 列=0 → 20
    第二组：行=1, 列=1 → 17
    第三组：行=0, 列=2 → 14
"""
# [[12 17 22]
#  [20 17 14]]